Revit 2027 API
HVACLoadBuildingType.BuildingTypeName Property
 The building type name.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string BuildingTypeName { get; set; }
Public Property BuildingTypeName As String
	Get
	Set
public:
property String^ BuildingTypeName {
	String^ get ();
	void set (String^ value);
}
member BuildingTypeName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: name is an empty string or contains only whitespace. -or- When setting this property: name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- When setting this property: The given value for name is already in use as a building type name.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
HVACLoadBuildingType Class
Autodesk.Revit.DB.Analysis Namespace